{
  "nestium.option_impact.low": "Низкое",
  "nestium.option_impact.medium": "Среднее",
  "nestium.option_impact.high": "Высокое",
  "nestium.option_impact.extreme": "Экстремальное",
  "nestium.option_impact.varies": "Варьируется",
  "nestium.options.pages.quality": "Качество",
  "nestium.options.pages.performance": "Производительность",
  "nestium.options.pages.advanced": "Дополнительно",
  "nestium.options.view_distance.tooltip": "Дальность прорисовки определяет, как далеко будет отрисовываться местность. Меньшие значения означают, что будет отрисовываться меньше местности, что улучшает частоту кадров.",
  "nestium.options.simulation_distance.tooltip": "Дистанция симуляции определяет, как далеко будут загружаться и обрабатываться местность и сущности. Меньшие значения могут снизить нагрузку на внутренний сервер и улучшить частоту кадров.",
  "nestium.options.brightness.tooltip": "Управляет минимальной яркостью в мире. При увеличении темные участки мира будут казаться светлее. Это не влияет на яркость уже хорошо освещенных участков.",
  "nestium.options.gui_scale.tooltip": "Устанавливает максимальный масштаб интерфейса пользователя. Если выбрано «Авто», всегда будет использоваться максимальный масштаб.",
  "nestium.options.fullscreen.tooltip": "Если включено, игра будет отображаться в полноэкранном режиме (если поддерживается).",
  "nestium.options.fullscreen_resolution.tooltip": "Разрешение монитора и частота обновления, используемые в полноэкранном режиме. Изменение этой опции может помешать работе других приложений и вызвать задержку при переключении между приложениями.\n\nПоддерживается только в операционной системе Windows.",
  "nestium.options.v_sync.tooltip": "Если включено, частота кадров игры будет синхронизирована с частотой обновления монитора, что сделает игру более плавной за счет увеличения задержки ввода. Эта настройка может снизить производительность, если ваша система слишком медленная.",
  "nestium.options.fps_limit.tooltip": "Ограничивает максимальное количество кадров в секунду. Это может помочь снизить использование батареи и нагрузку на систему при многозадачности. Если включена вертикальная синхронизация (VSync), эта опция будет игнорироваться, если значение ниже частоты обновления вашего дисплея.",
  "nestium.options.view_bobbing.tooltip": "Если включено, камера игрока будет покачиваться при движении. Игрокам, испытывающим укачивание, может быть полезно отключить эту опцию.",
  "nestium.options.attack_indicator.tooltip": "Управляет тем, где на экране отображается индикатор атаки.",
  "nestium.options.autosave_indicator.tooltip": "Если включено, при сохранении мира на диск будет отображаться индикатор.",
  "nestium.options.graphics_quality.tooltip": "Стандартное качество графики управляет некоторыми устаревшими опциями и необходимо для совместимости модов. Если опции ниже оставлены на «По умолчанию», они будут использовать эту настройку.",
  "nestium.options.clouds_quality.tooltip": "Уровень качества, используемый для отрисовки облаков. Хотя опции называются «Быстро» и «Детально», влияние на производительность незначительно.",
  "nestium.options.weather_quality.tooltip": "Управляет расстоянием, на котором будут отрисовываться погодные эффекты, такие как дождь и снег.",
  "nestium.options.leaves_quality.name": "Листва",
  "nestium.options.leaves_quality.tooltip": "Управляет тем, будет ли листва отрисовываться прозрачной (детально) или непрозрачной (быстро).",
  "nestium.options.particle_quality.tooltip": "Управляет максимальным количеством частиц, которые могут одновременно находиться на экране.",
  "nestium.options.smooth_lighting.tooltip": "Включает мягкое освещение и затенение блоков в мире. Это может незначительно увеличить время загрузки или обновления чанка, но не влияет на частоту кадров.",
  "nestium.options.biome_blend.value": "%s блок(ов)",
  "nestium.options.biome_blend.tooltip": "Расстояние (в блоках), на котором цвета биомов плавно смешиваются. Использование более высоких значений значительно увеличит время загрузки или обновления чанков при незначительном улучшении качества.",
  "nestium.options.entity_distance.tooltip": "Множитель дальности прорисовки, используемый для отрисовки сущностей. Меньшие значения уменьшают, а большие увеличивают максимальное расстояние, на котором будут отрисовываться сущности.",
  "nestium.options.entity_shadows.tooltip": "Если включено, под мобами и другими сущностями будут отрисовываться простые тени.",
  "nestium.options.vignette.name": "Виньетка",
  "nestium.options.vignette.tooltip": "Если включено, эффект виньетки будет применяться, когда игрок находится в темных местах, делая изображение темнее и драматичнее.",
  "nestium.options.mipmap_levels.tooltip": "Управляет количеством уровней mipmap, используемых для текстур моделей блоков. Более высокие значения обеспечивают лучшую отрисовку блоков на расстоянии, но могут негативно сказаться на производительности с ресурспаками, использующими много анимированных текстур.",
  "nestium.options.use_block_face_culling.name": "Отсечение граней блоков",
  "nestium.options.use_block_face_culling.tooltip": "Если включено, будут отрисовываться только грани блоков, обращенные к камере. Это может исключить огромное количество граней блоков на ранней стадии рендеринга, что значительно повышает производительность. Некоторые ресурспаки могут иметь проблемы с этой опцией, поэтому попробуйте отключить её, если видите дыры в блоках.",
  "nestium.options.use_fog_occlusion.name": "Использовать окклюзию тумана",
  "nestium.options.use_fog_occlusion.tooltip": "Если включено, чанки, которые полностью скрыты туманом, не будут отрисовываться, что помогает повысить производительность. Улучшение может быть более значительным при сильном тумане (например, под водой), но в некоторых сценариях это может вызвать нежелательные визуальные артефакты между небом и туманом.",
  "nestium.options.use_entity_culling.name": "Использовать отсечение сущностей",
  "nestium.options.use_entity_culling.tooltip": "Если включено, сущности, находящиеся в поле зрения камеры, но не внутри видимого чанка, будут пропущены при рендеринге. Эта оптимизация использует данные видимости, которые уже существуют для рендеринга чанков, и не добавляет накладных расходов.",
  "nestium.options.animate_only_visible_textures.name": "Анимировать только видимые текстуры",
  "nestium.options.animate_only_visible_textures.tooltip": "Если включено, будут обновляться только анимированные текстуры, которые определены как видимые на текущем кадре. Это может дать значительный прирост производительности на некотором оборудовании, особенно с тяжелыми ресурспаками. Если у вас возникли проблемы с тем, что некоторые текстуры не анимируются, попробуйте отключить эту опцию.",
  "nestium.options.cpu_render_ahead_limit.name": "Лимит рендеринга CPU наперед",
  "nestium.options.cpu_render_ahead_limit.tooltip": "Только для отладки. Определяет максимальное количество кадров, которые могут быть отправлены на GPU. Изменение этого значения не рекомендуется, так как очень низкие или высокие значения могут вызвать нестабильность частоты кадров.",
  "nestium.options.cpu_render_ahead_limit.value": "%s кадр(ов)",
  "nestium.options.performance_impact_string": "Влияние на производительность: %s",
  "nestium.options.use_persistent_mapping.name": "Использовать постоянное отображение",
  "nestium.options.use_persistent_mapping.tooltip": "Только для отладки. Если включено, для буфера подготовки будут использоваться постоянные отображения памяти, чтобы избежать ненужных копирований памяти. Отключение этого может быть полезно для выяснения причин графических артефактов.\n\nТребует OpenGL 4.4 или ARB_buffer_storage.",
  "nestium.options.chunk_update_threads.name": "Потоки обновления чанков",
  "nestium.options.chunk_update_threads.tooltip": "Определяет количество потоков, используемых для построения и сортировки чанков. Использование большего количества потоков может ускорить загрузку и обновление чанков, но может негативно сказаться на времени кадра. Значение по умолчанию обычно достаточно для всех ситуаций.",
  "nestium.options.always_defer_chunk_updates.name": "Всегда откладывать обновления чанков",
  "nestium.options.always_defer_chunk_updates.tooltip": "Если включено, рендеринг никогда не будет ждать завершения обновлений чанков, даже если они важны. Это может значительно улучшить частоту кадров в некоторых сценариях, но может вызвать значительную визуальную задержку, когда блоки появляются или исчезают с задержкой.",
  "nestium.options.use_no_error_context.name": "Использовать контекст без ошибок",
  "nestium.options.use_no_error_context.tooltip": "Если включено, контекст OpenGL будет создан с отключенной проверкой ошибок. Это немного улучшает производительность рендеринга, но может значительно усложнить отладку внезапных сбоев.",
  "nestium.options.buttons.undo": "Отменить",
  "nestium.options.buttons.apply": "Применить",
  "nestium.console.game_restart": "Для применения одной или нескольких настроек видео необходимо перезапустить игру!",
  "nestium.console.broken_nvidia_driver": "Ваши драйверы видеокарты NVIDIA устарели!\n  * Это вызовет серьезные проблемы с производительностью и сбои при установке Nestium.\n  * Пожалуйста, обновите драйверы видеокарты до последней версии (версия 536.23 или новее).",
  "nestium.console.core_shaders_error": "Следующие ресурспаки несовместимы с Nestium:",
  "nestium.console.core_shaders_warn": "Следующие ресурспаки могут быть несовместимы с Nestium:",
  "nestium.console.core_shaders_info": "Проверьте журнал игры для получения подробной информации.",
  "nestium.console.config_not_loaded": "Файл конфигурации Nestium поврежден или в данный момент не читается. Некоторые опции были временно сброшены к значениям по умолчанию. Пожалуйста, откройте экран настроек видео, чтобы решить эту проблему.",
  "nestium.console.config_file_was_reset": "Файл конфигурации был сброшен к заведомо исправным значениям по умолчанию.",
  "nestium.prompt.close": "Закрыть",
  "nestium.config_corrupted.title": "Nestium не удалось загрузить файл конфигурации",
  "nestium.config_corrupted.header": "Рендерер Nestium",
  "nestium.config_corrupted.sub_header": "Не удалось загрузить файл конфигурации",
  "nestium.config_corrupted.continue": "Продолжить",
  "nestium.config_corrupted.go_back": "Назад",
  "nestium.config_corrupted.body": "Произошла ошибка при попытке загрузить файл конфигурации. Это может произойти, если файл был поврежден на диске или при попытке отредактировать файл вручную.\n\nЕсли вы продолжите, файл конфигурации будет сброшен к заведомо исправным значениям по умолчанию, и вы потеряете все изменения, внесенные в ваши Настройки видео.\n\nДополнительную информацию об ошибке можно найти в файле журнала.",
  "nestium.options.screen_title": "Настройки рендеринга Nestium",
  "nestium.options.common.threads": "%s поток(ов)",
  "nestium.options.common.default": "По умолчанию",
  "key.entityculling.toggle": "Переключить отсечение сущностей",
  "key.entityculling.toggleBoxes": "Переключить хитбоксы сущностей",
  "text.entityculling.title": "Отсечение сущностей",
  "nestium.entityculling.enabled": "Отсечение включено",
  "nestium.entityculling.disabled": "Отсечение выключено",
  "nestium.entityculling.debug.enabled": "Отладка хитбоксов включена",
  "nestium.entityculling.debug.disabled": "Отладка хитбоксов выключена"
}